{
    "projects": [
        {
            "id": 0,
            "title": "Control System for Office Domotics",
            "photo": "assets/WindowBlinds.jpg",
            "company": "Embedded Systems",
            "summary": "Implementation of a Customizable and Scalable Voice Controlled Automation Control System for Office Domotics",
            "detail": "The project aims to transform existing manually controlled office domotics into an advanced system capable of remote control, automation, and voice control. By integrating control hardware featuring networking capabilities and a touchscreen interface, the project enhances operational efficiency and convenience. This system is designed to be scalable, allowing for the addition of more ZigBee actuators to accommodate varying needs. It also excels in data acquisition, capable of collecting information from sensors and streaming real-time data for advanced processing. A key highlight of this upgrade is the development of a modern and innovative user interface (UI). This UI cleverly blends reusable components with custom elements tailored to specific locations, ensuring a user-friendly experience that enhances interaction with the office environment. Additionally, the system includes voice control capabilities with one-shot inference based word detection, speech-to-text (STT), and natural language processing (NLP), further enhancing the ease of use and interaction with the system.",
            "tasks": [
                "Design scalable system architecture",
                "Hardware selection and procurement",
                "Integrate hardware components",
                "Train office staff",
                "Requirements gathering",
                "UI collaborative design",
                "Control Software Implementation",
                "System Testing",
                "Voice Control component definition"
            ],
            "tools": [
                "CI/CD",
                "UI/UX Design",
                "Prototyping",
                "Azure DevOps",
                "Raspberry Pi",
                "MQTT",
                "ZigBee",
                "Qt",
                "QtQuick",
                "QML",
                "Jira",
                "Confluence",
                "C++",
                "Python",
                "PyTorch",
                "TensorFlow",
                "TensorFlowLite",
                "Visual Studio Code",
                "QT Creator",
                "Git",
                "GitHub"
            ]
        },
        {
            "id": 1,
            "title": "CherishedLoveLocks",
            "photo": "assets/CherishedLoveLocks.png",
            "company": "web3",
            "summary": "Innovative Web3 dApp for Metaverse-Integrated NFTs",
            "detail": "The aim of this project is to develop a Web3 decentralized application (dApp) that introduces a new generation of NFTs (Non-Fungible Tokens) designed specifically for the metaverse. These NFT goods will transcend traditional collectibles by offering interactive, immersive, and utility-driven experiences in virtual environments. The project is focused on creating NFTs that can be used in various metaverse platforms, enhancing user engagement through unique digital assets that offer more than aesthetic value. The project will explore innovative ways to integrate these NFTs into the metaverse, ensuring they are versatile, interactive, and provide real-world utility, thereby setting a new standard for digital ownership.",
            "tasks": [
                "Full stack software development",
                "Business plan design",
                "Infrastructure provisioning and maintenance",
                "Art design",
                "Community management"
            ],
            "tools": [
                "Mocha",
                "Chai",
                "Semantic UI",
                "NextJs",
                "React",
                "Solidity",
                "web3",
                "Smart contracts",
                "etherjs",
                "web3js",
                "Hardhat",
                "Truffle",
                "SVG",
                "Git",
                "GitHub"
            ]
        },
        {
            "id": 2,
            "title": "Reticle Vectorization Tool",
            "photo": "assets/reticle.jpg",
            "company": "Defense",
            "summary": "Advanced reticle vectorization Tool to to bridge the gap between ballistic experts and the technical requirements of embedded systems",
            "detail": "This project is dedicated to developing a sophisticated reticle vectorizer, a software tool designed to convert reticles from bitmap file formats into the internal vector formats used by various devices. The primary goal is to bridge the gap between ballistic experts and the technical requirements of embedded systems. Ballistic experts will have the capability to design reticles using familiar and accessible graphic formats, without needing deep knowledge of embedded systems. The vectorizer will then translate these designs into compatible vector formats, allowing technicians to easily upload them into different devices. This conversion process aims to streamline reticle design, ensuring that custom designs are easily transferable and functional across a variety of platforms, thereby enhancing the efficiency and customization capabilities in ballistic equipment.",
            "tasks": [
                "Algorith definition",
                "Requirements gathering",
                "In charge of the DevOps of the project: Manage the DevOps strategy, optimizing development and operational processes for efficiency, reliability, and faster delivery through automation and continuous integration.",
                "Feedback management"
            ],
            "tools": [
                "Python",
                "Pillow",
                "Optics",
                "C",
                "SVN",
                "Subversion"
            ]
        }
    ]
}